[
  {
    "title":"God the Father",
    "date":"Oct 24 2014",
    "body":"<h2>God The Father<\/h2><h3>What is He?<\/h3><p>He is a spirit being - not flesh and blood. John 4:24<\/p><p>He is eternal - uncreated. Psalm 110:2, Genesis 1:1<\/p><p>He is holy. Revelation 4:8, John 17:11<\/p><p>He is good. Psalm 136:1<\/p><p>He is just. Acts 17:31<\/p><p>He is unchanging. Psalm 102:25-27, Isaiah 46:10, Hebrews 6:17, James 1:17<\/p><p>He is wise. Psalm 147:5<\/p><p>He is true. Hebrews 6:18<\/p><p>He is merciful. Exodus 24:6-7<\/p><p>He is faithful - trustworthy. 1 Corinthians 1:9<\/p><p>(Much of the above is not exclusive to the Father.)<\/p><h3>Where is He?<\/h3><p>He is in heaven seated on His throne. (Spoiler alert: Jesus is at his right hand, interceding - praying - on our behalf. Feels good doesn't it.) Luke 22:69, Mark 16:19, Romans 8:34<\/p><h3>Who is He?<\/h3><p>He is the Father part of the Triune God. I do not think that our minds can comprehend the Trinity. I think it is safe to say that there is no earthly explanation of the concept. Things we state as facts about God seem to be mutually exclusive: God is one. God the Father, Son and Spirit. Suffice to say, it is confusing. Moving on.<\/p><h4>We call him Father. Why?<\/h4><p>Jesus called him Father. Mark 14:36<\/p><p>Jesus told us to call him Father. Mathew 6:9-13<\/p><h4>What does it mean for Him to be the Father?<\/h4><p>In order to be a Father, one must have a son (or daughter, but in this case son). It is a relational title that requires a counter person, again the Son. The Father did not begat, birth or create the Son. God is unchanging. He has always been a Father/Son/Spirit relationship. The Father did not become the Father. He is the Father.<\/p><p>Mathew 11:27, Genesis 1:26<\/p><h3>What does He do?<\/h3><p>He is the decision maker for the Trinity. His will is carried out by the Son and the Spirit. Apparently the God-persons do not share a knowledge space - I told you it is confusing. Only the Father knows when he will send the Son back to Earth.<\/p><p>Mathew 24:36, Luke 22:42, John 14:26, John 6:39, John 12:49-50, John 5:19, John 5:30, John 14:31<\/p><h3>Discussion Questions<\/h3><p>What is your favorite aspect of the Father? Why?<\/p><p>Which aspects of the Father are most difficult for you to believe or understand? Why?<\/p><p>What are some false beliefs about the Father that you see in the secular - non-Christian - world?<\/p><p>To whom should we pray? Why?<\/p><p>Brain Teaser: Hilary's felicitous paradox: &quot;The Father is the greater without the Son being the lesser.&quot;<\/p>",
     "preview":"<p>God The Father<\/p><p>What is He?<\/p><p>He is a spirit being - not flesh and blood. John 4:24<\/p>",
     "url":"god-the-father"
  },
	{
    "title":"Big Bend",
    "date":"March 23 2016",
    "body":"<img src=\"/blog-post/big-bend/south-rim-sunset-pano.jpg\" width=\"1200\" alt=\"south-rim-sunset-pano\"\/><h2>Planning<\/h2><h3>Food and water<\/h3><p>My brother - Abe, some friends of our and myself like to do at least one adventure per year. This year ended up including Tyler and Chris. The idea of doing the Outer Mountain Loop inspired the destination of Big Bend. But after doing some research, we realized that since you can't reserve sites in advance at Big Bend - for some reaso - we'd have to just show up and be flexible. Also, we got the impression when we called that the park ranger we spoke to thought it would be a bad idea and that we should stay in the Chisos Mountains. Spioler alert: he was right. So, the plan was simple. Show up with enough food and water for 4 days and see what happens.<\/p><p>Speaking of food and water... Planning food for a backpackig trip is very different than planning water. Water is easy to plan. Take the number of days on the trail times 4 and you have the number of liters you'll need. Carrying water - not so easy.<\/p><img src=\"/blog-post/big-bend/meals.png\" width=\"800\" alt=\"meals\"\/><p>Food, as you can see above, takes a little more planning. I recently learned about brining olive oil to add to my freeze dried meals. I must say, it is quite nice and a huge calorie per oz winner at 240.<\/p><h3>Gear<\/h3><img src=\"/blog-post/big-bend/gear.jpg\" width=\"1200\" alt=\"gear\"\/><ul><li>Pack - REI Flash 65<\/li><li>Sleeping Bag - REI Halo 25<\/li><li>Pad - REI Ari Rails<\/li><li>Pillow - Exped Air Pillow (I love this pillow.)<\/li><li>Sleeping bag-pad straps (so money)<\/li><li>Tent - MSR Mutha Hubba (we had 3 in the tent and one in a bivy)<\/li><li>Water bottle - 1L Nalgene<\/li><li>Bladder - 2L CamelBak<\/li><li>Resevoirs - 10L & 6L MSR Domedary<\/li><li>Headlamp - Petzl Tikka<\/li><li>Boots - Asolo Avalon GXT<\/li><li>Socks - REI Wool Hiking Socks (4 pair)<\/li><li>Shorts<\/li><li>Undies - UnderArmor Boxer Briefs (4 pair)<\/li><li>Shirts - Smart Wool (short sleve x1, long sleeve x2)<\/li><li>Knit cap<\/li><li>Jacket - Patagonia Down Sweater<\/li><li>Warm pants - North Face micro-fleece<\/li><li>Rain jacket - Marmot Gortex shell<\/li><li>Rain pants - REI something (too heavy, I need to get something lighter)<\/li><li>Sunglasses<\/li><li>Tevas<\/li><li>First aid kit<\/li><li>Sun screen<\/li><li>Toothbrush<\/li><li>Toothpaste<\/li><li>Lip balm<\/li><li>Ibuprofen<\/li><li>Compass<\/li><li>Knife<\/li><li>Topo map<\/li><li>Paracord<\/li><li>Toilet paper<\/li><li>Trowel<\/li><li>Pack cover<\/li><li>Stool - aluminum tri-pod<\/li><li>Sierra cup<\/li><li>Spork<\/li><li>Coffee mug<\/li><li>Pot - 1L REI TiWare<\/li><li>Stove - MSR Pocket Rocket<\/li><li>Fuel<\/li><li>Matches - in waterproof container<\/li><li>Day pack - CamelBak (too bulky, next time I will bring something like the REI Flash 15)<\/li><li>Stuff sacks - food, cloths, pad, bag, pillow, pot<\/li><h2>Let's do this<\/h2><h3>Day One - The Window<\/h3><p>We hit the road at 4:30a. By the time the sun was up, we were already a little delirious<\/p><img src=\"/blog-post/big-bend/hit-the-road-wide.jpg\" width=\"1200\" alt=\"hit-the-road\"\/><p>We got to the park and headed straight to Panther Junction to try to get our backcountry permit. It was 2p by this point and we had to settle for a car camping site in the Chisos Basin.<\/p><img src=\"/blog-post/big-bend/first-site-afternoon.jpg\" width=\"1200\" alt=\"first-site-afternoon\"\/><img src=\"/blog-post/big-bend/first-site-morning-austin.jpg\" width=\"1200\" alt=\"first-site-morining-austin\"\/><p>As you can see, the Chisos Basin is spectacular - in the afternoon or in the morning. After we set up camp, we headed down the famous \"Window Trail\". What a great trail. Not a secluded trail, but with a rumbling storm in the distance... Quite the experience. The window itself is very interesting. The rock is worn extremely smooth and slick. My palms start to sweat just thinking about being in window. It seemed that any moment I might start a slide that would end in an 200 foot fall. But, it also seemed like a good spot to have a snack. Just not too close to the edge.<\/p><img src=\"/blog-post/big-bend/window-snack.jpg\" width=\"1200\" alt=\"window-snack\"\/><p>Then we headed back to camp. We got about 5 minutes of sparce but big rain drops as a cold front came through while we made dinner. But, other than that the front only brought cooler weather and a night of wind.<\/p><h3>Day Two - Emory Peak<\/h3><p>We woke up with the sun the next morning, quickly climbed into the car and scooted over to Panther Junction to be the first campers in line for backcountry permits. It was worth it. After startling the nice park ranger when she unlocked the door to open for business, we were able to score primitive sites for the next two nights, the second night being on the South Rim. So, we headed back to camp to pack up and head to the trailhead.<\/p><img src=\"/blog-post/big-bend/pinnacles-trail-sign.jpg\" width=\"1200\" alt=\"pinnacles-trail-sign\"\/><p>We started that cold, cloudy-morning hike on the Pinnacles Trail. We had to carry all of our water and our packs were heavy that day. Let's just say it was a good day for a steep ascent. Really though, it was a climb, but nothing extrodinary. It was a short hike - up through the pass between Toll Mountain and Emory Peak - with many built-in breaks to stop and take a picture and/or admire a view.<\/p><img src=\"/blog-post/big-bend/pinnacles-trail-group.jpg\" width=\"1200\" alt=\"pinnacles-trail-group\"\/><img src=\"/blog-post/big-bend/boot-canyon-group.jpg\" width=\"1200\" alt=\"boot-canyon-group\"\/><p>After peaking at the pass, we cruised down into Boot Canyon to our site - BC4. Here we made camp, grabbed a nap in the sunshine, ate some snacks, and tossed the disc.<\/p><img src=\"/blog-post/big-bend/second-site-disc-austin.jpg\" width=\"1200\" alt=\"second-site-disc-austin\"\/><p>Refueled and rested, we grabbed our daypacks and headed back out of Boot Canyon and up Emory Peak. The trail goes almost all the way to the summit. There is a mild climb to get the last 50 ft or so to the top. Once on top, you can see beautiful desert mountains in every direction for miles. We had about 45 minutes to sunset, so we hunkered down to get some protection from the desert sun and wait it out with our new compadres. There were 7 others on top of EP (Emory Peak) with us as well as some radio antennas and what appeared to be a solar powered cellular antenna.<\/p><img src=\"/blog-post/big-bend/emory-peak-group-chilling.jpg\" width=\"1200\" alt=\"emory-peak-group-chilling\"\/><p>The sun set slowly as we soaked up the desert views and even caught a glimpse of the rare Colima Warlbler while waiting out the sunset on the peak.<\/p><img src=\"/blog-post/big-bend/emory-peak-austin-chris-sunset.jpg\" width=\"1200\" alt=\"emory-peak-austin-chris-sunset\"\/><img src=\"/blog-post/big-bend/emory-peak-abe-sunset.jpg\" width=\"1200\" alt=\"emory-peak-abe-sunset\"\/><img src=\"/blog-post/big-bend/emory-peak-brothers-sunset-dark.jpg\" width=\"1200\" alt=\"emory-peak-brothers-sunset-dark\"\/><img src=\"/blog-post/big-bend/emory-peak-austin-sunset-dark.jpg\" width=\"1200\" alt=\"emory-peak-austin-sunset-dark\"\/><p>By the time the sun was down, the girls had all headed back to their respective camps. The holdouts were the two fellas from the Great North West and our foursome. After the sun was down, Tyler and Chris headed back to camp to get some dinner and get ready for bed. Abe and I waited for some stars. We got a lot of moon. We were also visited by some creatues of the night. Our first guest on the summit was a little mouse. He was shortly followed by a ring-tailed cat.<\/p><p>Once dusk transitioned to night, Abe and I enjoyed the rare moonlit mountain decent and hike back to camp - headlamps present but not employed. We cruised down hill the whole way ocassionaly breakig stride to navigate a shadow-heavy portion of trail. Once back to camp, we rushed through dinner and hopped into our bags to get some rest.<\/p><h3>Day Three - The South Rim<\/h3><p>With a short hike upcoming, we slept in and relaxed in the morning. It was strange to wake up at 9am on a backpacking trip. It was a clear and calm night, so Tyler decided to sleep under the stars. <\/p><img src=\"/blog-post/big-bend/second-site-morning.jpg\" width=\"1200\" alt=\"second-site-morning\"\/><p>After a brief hike out of Boot Canyon, we made it to the South Rim trail. It is famous for a reason.<\/p><img src=\"/blog-post/big-bend/south-rim-morning-group.jpg\" width=\"1200\" alt=\"south-rim-morning-group\"\/><img src=\"/blog-post/big-bend/south-rim-morning-abe-dropoff.jpg\" width=\"1200\" alt=\"south-rim-morning-abe-dropoff\"\/><img src=\"/blog-post/big-bend/south-rim-morning-slope.jpg\" width=\"1200\" alt=\"south-rim-morning-slope\"\/><p>The sun started to burn through the clouds as we set up our final campsite.<\/p><img src=\"/blog-post/big-bend/third-site-afternoon-tyler.jpg\" width=\"1200\" alt=\"third-site-afternoon-tyler\"\/><p>After resting, snacking, and tossing the disc a little, we decided to get in another day hike - the Colima trail. The sun was brutal - in our face out and back due to poor timing. Thankfully we did get some new looks at Emory Peak. Also, we were able to familiarize ourself with the part of the trail that we would start in the dark the next morning. Once back at camp, we went ahead and ate dinner so we could get to bed right after exploring the rim.<\/p><img src=\"/blog-post/big-bend/colima-trail-abe.jpg\" width=\"1200\" alt=\"colima-trail-abe\"\/><img src=\"/blog-post/big-bend/colima-trail-austin-tyler.jpg\" width=\"1200\" alt=\"colima-trail-austin-tyler\"\/><p>In hind-sight, we should have skipped the Colima trail gone straight back to the South Rim and made dinner out there. Thankfully we did eventually make it back to the rim about an hour before sunset. We took most of that hour to slowly explore the ledges and take in the vews. Once we found a good spot, we settled in for another epic sunset.<\/p><img src=\"/blog-post/big-bend/south-rim-afternoon-abe.jpg\" width=\"1200\" alt=\"south-rim-afternoon-abe\"\/><img src=\"/blog-post/big-bend/south-rim-afternoon-austin-dropoff.jpg\" width=\"1200\" alt=\"south-rim-afternoon-austin-dropoff\"\/><img src=\"/blog-post/big-bend/south-rim-afternoon-chris.jpg\" width=\"1200\" alt=\"south-rim-afternoon-chris\"\/><p>Seriously, the rim is incredible. By this point it was Sunday afternoon. I don't think there were many people left in the park, let alone all the way out on the rim. When we weren't talking and the wind stopped, it was completely silent. No sound. Nothing.<\/p><img src=\"/blog-post/big-bend/south-rim-sunset-chris.jpg\" width=\"1200\" alt=\"south-rim-sunset-chris\"\/><img src=\"/blog-post/big-bend/south-rim-sunset-austin.jpg\" width=\"1200\" alt=\"south-rim-sunset-austin\"\/><img src=\"/blog-post/big-bend/south-rim-sunset-abe.jpg\" width=\"1200\" alt=\"south-rim-sunset-abe\"\/><img src=\"/blog-post/big-bend/south-rim-sunset-abe-austin-tyler.jpg\" width=\"1200\" alt=\"south-rim-sunset-abe-austin-tyler\"\/><img src=\"/blog-post/big-bend/south-rim-sunset-austin-dark.jpg\" width=\"1200\" alt=\"south-rim-sunset-austin-dark\"\/><p>We once again stayed out till the sun was gone, the moon was high and the stars were out. And once again, the hike back did not require added light. Once back at camp, we wasted no time settling into the tent and getting to bed.<\/p><h3>Day Four - Let's go home<\/h3><p>Early to rise. The alarm went off at 5:30a. We wanted to break camp and hit the trail before sunrise to get to the car as soon as possible. Both Chris and Tyler planned to be at work early the next day. We didn't want to get a late start on our long car ride. But as we were about to hit the trail, we noticed the nearly full moon about to set over... the South Rim. We dropped our packs and quietly sipped our coffee as we watched this new-to-us-concept of a moon-set behind the desert mountains.<\/p><p>After the weekend we'd had, there wasn't much worth stopping for on the hike out, but we did snag a few pictures; including one where I was unaware that Tyler was trying to hold my hand.<\/p><img src=\"/blog-post/big-bend/meadows-trail-morning-abe-austin.jpg\" width=\"1200\" alt=\"meadows-trail-morning-abe-austin\"\/><img src=\"/blog-post/big-bend/meadows-trail-morning-austin-tyler.jpg\" width=\"1200\" alt=\"meadows-trail-morning-austin-tyler\"\/><p>Once back at the car, we changed into some fresh cloths. This did not prevent the car ride back form being a little funky, though. On the drive out of Big Bend, we saw a mountain lion cross the road about 3/4 of a mile in front of us. Funk and mountain lion aside, we made it home safe after an unforgettable adventure.<\/p><img src=\"/blog-post/big-bend/sign-group.jpg\" width=\"1200\" alt=\"sign-group\"\/>",
     "preview":"<p>Memories seared into my brain.<\/p>",
     "url":"big-bend"
   }
]